mdhardenburgh/Blinky/Packages/.cache/APEXMIC.APM32F1xx_DFP.1.0.0.pdsc
<?xml version="1.0" encoding="utf-8"?>

<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>APEXMIC</vendor>
  <name>APM32F1xx_DFP</name>
  <description>APEX Microelectronics APM32F1 Series Device Support, Drivers and Examples</description>
  <url>https://v1.cecdn.yun300.cn/site_1807300217/</url>
  
  <releases>
    <release version="1.0.0" date="2019-04-30">
      First Release version of APM32F1 Device Family Pack.
    </release>
  </releases>

  <keywords>
    <!-- keywords for indexing -->
    <keyword>APEX</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package APEX Microelectronics</keyword>
    <keyword>APM32F1</keyword>
    <keyword>APM32</keyword>
  </keywords>

<devices>
    <family Dfamily="APM32F1 Series" Dvendor="APEXMIC:153">
      <processor Dcore="Cortex-M3" DcoreVersion="r1p1"/>
      <book name="Documents/dui0552a_cortex_m3_dgug.pdf" title="Cortex-M3 Generic User Guide"/>
      <description>
APEX Microelectronics' APM32F1 series of mainstream MCUs are 32-bit microprocessors based on ARM Cortex'-M3 core, with a maximum operating frequency of 72MHz. Built-in AHB high-performance bus, combined with high-speed memory and DMA, can achieve rapid data processing and storage. Built-in APB advanced peripheral bus extends the rich peripherals and enhanced I/O, guarantees the rapidity of connection and flexibility of control. The chip is equipped with powerful FPU floating-point processing unit, which supports single-precision data processing instructions and data types. 
        </description>
      <!-- ************************  Subfamily 'APM32F103'  **************************** -->
      <subFamily DsubFamily="APM32F103">
        <feature type="USBD" n="1"/>
        <feature type="CAN" n="1"/>

      <!-- *************************  Device 'APM32F103VB'  ***************************** -->
      <device Dname="APM32F103VB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/apm32f10x.h" define="APM32F10X_MD"/>
		<debug svd="SVD/APM32F103xx.svd"/>
        <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
        
        <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
        <book name="Documents/APM32F103x4x6x8xb_APM32E103xB_DS_V1.0.0.pdf" title="APM32F103 Data Sheet"/>
        <feature type="Timer" n="4" m="16"/>
        <feature type="ADC" n="16" m="12"/>
        <feature type="IOs" n="80"/>
        <feature type="SPI" n="2" m="18000000"/>
        <feature type="I2C" n="2"/>
        <feature type="USART" n="3" m="4500000"/>
        <feature type="QFP" n="100"/>
        <feature type="BGA" n="100"/>
      </device><!-- *************************  Device 'APM32F103V8'  ***************************** --><device Dname="APM32F103V8">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/apm32f10x.h" define="APM32F10X_MD"/>
		<debug svd="SVD/APM32F103xx.svd"/>
        
        <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
        <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
        <book name="Documents/APM32F103x4x6x8xb_APM32E103xB_DS_V1.0.0.pdf" title="APM32F103 Data Sheet"/>
        <feature type="Timer" n="4" m="16"/>
        <feature type="ADC" n="16" m="12"/>
        <feature type="IOs" n="80"/>
        <feature type="SPI" n="2" m="18000000"/>
        <feature type="I2C" n="2"/>
        <feature type="USART" n="3" m="4500000"/>
        <feature type="QFP" n="100"/>
        <feature type="BGA" n="100"/>
      </device><!-- *************************  Device 'APM32F103RB'  ***************************** --><device Dname="APM32F103RB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/apm32f10x.h" define="APM32F10X_MD "/>
		<debug svd="SVD/APM32F103xx.svd"/>
        
        <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
        <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
        <book name="Documents/APM32F103x4x6x8xb_APM32E103xB_DS_V1.0.0.pdf" title="APM32F103 Data Sheet"/>
        <feature type="Timer" n="4" m="16"/>
        <feature type="ADC" n="16" m="12"/>
        <feature type="IOs" n="80"/>
        <feature type="SPI" n="2" m="18000000"/>
        <feature type="I2C" n="2"/>
        <feature type="USART" n="3" m="4500000"/>
        <feature type="QFP" n="64"/>
        <feature type="BGA" n="64"/>
      </device><!-- *************************  Device 'APM32F103R8'  ***************************** --><device Dname="APM32F103R8">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/apm32f10x.h" define="APM32F10X_MD"/>
		<debug svd="SVD/APM32F103xx.svd"/>
        
        <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
        <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
        <book name="Documents/APM32F103x4x6x8xb_APM32E103xB_DS_V1.0.0.pdf" title="APM32F103 Data Sheet"/>
        <feature type="Timer" n="4" m="16"/>
        <feature type="ADC" n="16" m="12"/>
        <feature type="IOs" n="80"/>
        <feature type="SPI" n="2" m="18000000"/>
        <feature type="I2C" n="2"/>
        <feature type="USART" n="3" m="4500000"/>
        <feature type="QFP" n="64"/>
        <feature type="BGA" n="64"/>
      </device><!-- *************************  Device 'APM32F103R6'  ***************************** --><device Dname="APM32F103R6">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/apm32f10x.h" define="APM32F10X_MD"/>
		<debug svd="SVD/APM32F103xx.svd"/>
        
        <memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x2800" init="0" default="1"/>
        <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
        <book name="Documents/APM32F103x4x6x8xb_APM32E103xB_DS_V1.0.0.pdf" title="APM32F103 Data Sheet"/>
        <feature type="Timer" n="4" m="16"/>
        <feature type="ADC" n="16" m="12"/>
        <feature type="IOs" n="80"/>
        <feature type="SPI" n="2" m="18000000"/>
        <feature type="I2C" n="2"/>
        <feature type="USART" n="3" m="4500000"/>
        <feature type="QFP" n="64"/>
        <feature type="BGA" n="64"/>
      </device><!-- *************************  Device 'APM32F103R4'  ***************************** --><device Dname="APM32F103R4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/apm32f10x.h" define="APM32F10X_LD"/>
		<debug svd="SVD/APM32F103xx.svd"/>
        
