mdhardenburgh/Blinky/Packages/.cache/APEXMIC.APM32F1xx_DFP.1.0.0.pdsc
        <memory id="IROM1" start="0x08000000" size="0x4000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x1000" init="0" default="1"/>
        <algorithm name="Flash/APM32F10x_16.FLM" start="0x08000000" size="0x40000" default="1"/>
        <book name="Documents/APM32F103x4x6x8xb_APM32E103xB_DS_V1.0.0.pdf" title="APM32F103 Data Sheet"/>
        <feature type="Timer" n="4" m="16"/>
        <feature type="ADC" n="16" m="12"/>
        <feature type="IOs" n="80"/>
        <feature type="SPI" n="2" m="18000000"/>
        <feature type="I2C" n="2"/>
        <feature type="USART" n="3" m="4500000"/>
        <feature type="QFP" n="64"/>
        <feature type="BGA" n="64"/>
      </device><!-- *************************  Device 'APM32F103CB'  ***************************** --><device Dname="APM32F103CB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/apm32f10x.h" define="APM32F10X_MD"/>
		<debug svd="SVD/APM32F103xx.svd"/>
        
        <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
        <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
        <book name="Documents/APM32F103x4x6x8xb_APM32E103xB_DS_V1.0.0.pdf" title="APM32F103 Data Sheet"/>
        <feature type="Timer" n="4" m="16"/>
        <feature type="ADC" n="16" m="12"/>
        <feature type="IOs" n="80"/>
        <feature type="SPI" n="2" m="18000000"/>
        <feature type="I2C" n="2"/>
        <feature type="USART" n="3" m="4500000"/>
        <feature type="QFP" n="48"/>
        <feature type="BGA" n="48"/>
      </device><!-- *************************  Device 'APM32F103C8'  ***************************** --><device Dname="APM32F103C8">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/apm32f10x.h" define="APM32F10X_MD"/>
		<debug svd="SVD/APM32F103xx.svd"/>
        
        <memory id="IROM1" start="0x08000000" size="0x10000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
        <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
        <book name="Documents/APM32F103x4x6x8xb_APM32E103xB_DS_V1.0.0.pdf" title="APM32F103 Data Sheet"/>
        <feature type="Timer" n="4" m="16"/>
        <feature type="ADC" n="16" m="12"/>
        <feature type="IOs" n="80"/>
        <feature type="SPI" n="2" m="18000000"/>
        <feature type="I2C" n="2"/>
        <feature type="USART" n="3" m="4500000"/>
        <feature type="QFP" n="48"/>
        <feature type="BGA" n="48"/>
      </device><!-- *************************  Device 'APM32F103C6'  ***************************** --><device Dname="APM32F103C6">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/apm32f10x.h" define="APM32F10X_MD"/>
		<debug svd="SVD/APM32F103xx.svd"/>
        
        <memory id="IROM1" start="0x08000000" size="0x8000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x2800" init="0" default="1"/>
        <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
        <book name="Documents/APM32F103x4x6x8xb_APM32E103xB_DS_V1.0.0.pdf" title="APM32F103 Data Sheet"/>
        <feature type="Timer" n="4" m="16"/>
        <feature type="ADC" n="16" m="12"/>
        <feature type="IOs" n="80"/>
        <feature type="SPI" n="2" m="18000000"/>
        <feature type="I2C" n="2"/>
        <feature type="USART" n="3" m="4500000"/>
        <feature type="QFP" n="48"/>
        <feature type="BGA" n="48"/>
      </device><!-- *************************  Device 'APM32F103C4'  ***************************** --><device Dname="APM32F103C4">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/apm32f10x.h" define="APM32F10X_LD"/>
		<debug svd="SVD/APM32F103xx.svd"/>
        
        <memory id="IROM1" start="0x08000000" size="0x4000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x1800" init="0" default="1"/>
        <algorithm name="Flash/APM32F10x_16.FLM" start="0x08000000" size="0x40000" default="1"/>
        <book name="Documents/APM32F103x4x6x8xb_APM32E103xB_DS_V1.0.0.pdf" title="APM32F103 Data Sheet"/>
        <feature type="Timer" n="4" m="16"/>
        <feature type="ADC" n="16" m="12"/>
        <feature type="IOs" n="80"/>
        <feature type="SPI" n="2" m="18000000"/>
        <feature type="I2C" n="2"/>
        <feature type="USART" n="3" m="4500000"/>
        <feature type="QFP" n="48"/>
        <feature type="BGA" n="48"/>
      </device><!-- *************************  Device 'APM32F103TB'  ***************************** --><device Dname="APM32F103TB">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/apm32f10x.h" define="APM32F10X_MD"/>
		<debug svd="SVD/APM32F103xx.svd"/>
        
        <memory id="IROM1" start="0x08000000" size="0x20000" startup="1" default="1"/><memory id="IRAM1" start="0x20000000" size="0x5000" init="0" default="1"/>
        <algorithm name="Flash/APM32F10x_128.FLM" start="0x08000000" size="0x20000" default="1"/>
        <book name="Documents/APM32F103x4x6x8xb_APM32E103xB_DS_V1.0.0.pdf" title="APM32F103 Data Sheet"/>
        <feature type="Timer" n="4" m="16"/>
        <feature type="ADC" n="16" m="12"/>
        <feature type="IOs" n="80"/>
        <feature type="SPI" n="2" m="18000000"/>
        <feature type="I2C" n="2"/>
        <feature type="USART" n="3" m="4500000"/>
        <feature type="QFP" n="32"/>
        <feature type="BGA" n="32"/>
      </device><!-- *************************  Device 'APM32F103T8'  ***************************** --><device Dname="APM32F103T8">
        <processor Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="72000000"/>
        <compile header="Device/Include/apm32f10x.h" define="APM32F10X_MD"/>
		<debug svd="SVD/APM32F103xx.svd"/>
        
