mdhardenburgh/Blinky/Packages/.cache/APEXMIC.APM32F1xx_DFP.1.0.0.pdsc
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="PWR" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCC">
      <description>Power controller (PWR) driver for APM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_PWR
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_pwr.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_pwr.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RCC" Cversion="1.0.0" condition="APM32F1xx STDPERIPH">
      <description>Reset and clock control (RCC) driver for APM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RCC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_rcc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_rcc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="RTC" Cversion="1.0.0" condition="APM32F1xx STDPERIPH">
      <description>Real-time clock (RTC) driver for APM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_RTC
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_rtc.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_rtc.c"/>
      </files>
    </component>

   
    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="SPI" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCC">
      <description>Serial peripheral interface (SPI) driver for APM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_SPI
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_spi.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_spi.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="TIM" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCC">
      <description>Timers (TIM) driver for APM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_TIM
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_tim.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_tim.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="USART" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCC">
      <description>Universal synchronous asynchronous receiver transmitter (USART) driver for APM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_USART
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_usart.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_usart.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="StdPeriph Drivers" Csub="WWDG" Cversion="1.0.0" condition="APM32F1xx STDPERIPH RCC">
      <description>Window watchdog (WWDG) driver for APM32F1xx</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPH_WWDG
      </RTE_Components_h>
      <files>
        <file category="header" name="Device/StdPeriph_Driver/inc/apm32f10x_wwdg.h"/>
        <file category="source" name="Device/StdPeriph_Driver/src/apm32f10x_wwdg.c"/>
      </files>
    </component>
  <!-- END: APEX Microelectronics Standard Peripherals Drivers -->
  </components>
  
  
  <boards>
    <board vendor="APEXMIC" name="APM32F103MINI" revision="Ver 1.0">
      <description>APEXMIC APM32F103 Development Board</description>
      <image  large="Boards/APEXMIC/APM32F103MINI/Documentation/APM32E103-MINI.JPG"/>
      <mountedDevice    deviceIndex="0" Dvendor="APEXMIC:153" Dname="APM32F103VB"/>
      <compatibleDevice deviceIndex="0" Dvendor="APEXMIC:153" DsubFamily="APM32F103"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full Speed Device"/>
      <feature type="RS232"           n="1"/>
      <feature type="Button"          n="3"              name="Reset, KEY1 and KEY2"/>
      <feature type="LED"             n="2"              name="LEDs directly connected to port pins"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
    </board>
    
  </boards>
  
  <examples>
    <example name="Blinky" doc="Abstract.txt" folder="Boards/APEXMIC/APM32F103MINI/Blinky">
      <description>APM32_MINI  Blinky example</description>
      <board name="APM32F103MINI" vendor="APEXMIC"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
          <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
        <keyword>LED</keyword>
      </attributes>
    </example>
  </examples>
</package>
